app/controllers/courses_controller.rb

SELECT "spots".* FROM "spots" WHERE "spots"."course_id" = ? AND "spots"."name" = ?  [["course_id", 1], ["name", "TestA"]]
---
  def show
    #@course = Course.spot.where(cource_id: params[:id],name: params[:text])
    #@course = Course.joins(:spot).where"course_id == ? and name == ?",params[:id],params[:name]
    #@course = Course.find_by(name: params[:name])
    @course = Course.find(params[:id]).spot.where(name: params[:text])